Repository: TencentCloud/chat-uikit-ios
Catalog: Demo/TUIKitDemo/*.lproj/Localizable.strings
Languages: ar, zh_hant

source: Cancel
ar: إلغاء
zh_hant: 取消

source: Cancel
ar: إلغاء
zh_hant: 取消

source: Send
ar: إرسال
zh_hant: 發送

# Alia
source: Remark
ar: ملاحظة
zh_hant: 備註

# Group
source: List
ar: قائمة
zh_hant: 分組

source: OK
ar: موافق
zh_hant: 好

# Accept
source: Agree
ar: موافقة
zh_hant: 同意

source: Decline
ar: رفض
zh_hant: 拒絕

source: Password
ar: كلمة المرور
zh_hant: 密碼

# done
source: OK
ar: موافق
zh_hant: 完成

# Done
source: OK
ar: موافق
zh_hant: 完成

source: Log Out
ar: تسجيل الخروج
zh_hant: 退出登錄

source: Log In
ar: تسجيل الدخول
zh_hant: 登錄

# confirm
source: OK
ar: موافق
zh_hant: 確定

source: Save
ar: حفظ
zh_hant: 保存

source: Save
ar: حفظ
zh_hant: 保存

source: None
ar: لا شيء
zh_hant: 無

# choose_avatar_for_you
source: The App randomly assigns you a system avatar.
ar: تقوم التطبيق بتعيين صورة رمزية نظامية عشوائية لك.
zh_hant: App隨機為您分配一個系統頭像

# AppLoginSucc
source: Successfully logged in
ar: تم تسجيل الدخول بنجاح
zh_hant: 已成功登錄

# AppGetAccessAddressFail
source: The service is abnormal. Please check the network and try again
ar: الخدمة غير طبيعية. يرجى التحقق من الشبكة والمحاولة مرة أخرى
zh_hant: 服務異常，請檢查網絡後重試

# AppOfflineTitle
source: Account Offline
ar: تسجيل الخروج من الحساب
zh_hant: 下線通知

# AppOfflineDesc
source: Your account is logged in on another mobile phone
ar: تم تسجيل الدخول إلى حسابك على هاتف محمول آخر
zh_hant: 您的賬號於另一台手機上登錄

# AppCancelRelogin
source: Logout
ar: تسجيل الخروج
zh_hant: 退出

# AppConfirmRelogin
source: Login again
ar: تسجيل الدخول مرة أخرى
zh_hant: 重新登錄

# AppMainTitle
source: TencentCloud·IM
zh_hant: 騰訊雲·IM

# AppMainConnectingTitle
source: Connecting…
ar: جارٍ الاتصال...
zh_hant: 連接中...

# AppMainDisconnectTitle
source: TencentCloud·IM (not connected)
ar: TencentCloud·IM (غير متصل)
zh_hant: 騰訊雲·IM(未連接)

# TabBarItemMessageText
source: Message
ar: الرسائل
zh_hant: 消息

# TabBarItemContactText
source: Contacts
ar: جهات الاتصال
zh_hant: 通訊錄

# TabBarItemMeText
source: Settings
ar: الإعدادات
zh_hant: 設置

# ChatsCreateFailed
source: Create Group Failed
ar: فشل إنشاء المجموعة
zh_hant: 創建群失敗

# ChatSecurityWarning
source: Do not easily believe in remittance, winning prizes, and other information. Be cautious when dealing with unknown phone calls to avoid being deceived. Please report any suspicious situations in a timely manner.
ar: [تذكير أمان] يتم استخدام هذا التطبيق فقط لتجربة ميزات منتجات Tencent Cloud Chat ولا يمكن استخدامه للتفاوض التجاري والتوسع. يرجى عدم الوثوق في التحويل المالي والفوز في اليانصيب وغيرها من المعلومات المتعلقة بالمال، وعدم إجراء مكالمات هاتفية غريبة بسهولة، والحذر من الاحتيال.
zh_hant: 請勿輕信匯款、中獎等信息，謹慎對待陌生電話，避免上當受騙。遇到可疑情況請及時反饋。

# ChatSecurityWarningReport
source: Report
ar: الإبلاغ عنها
zh_hant: 點此舉報

# ChatSecurityWarningGot
source: Got it
ar: يستلم
zh_hant: 我知道了

# MeAbout
source: About TencentCloud Chat
ar: حول TencentCloud·IM
zh_hant: 關於騰訊雲·IM

# MeDevelop
source: Develop and Debug
ar: تطوير وتصحيح الأخطاء
zh_hant: 開發調試

# MeReportMemoryLeak
source: Report Memory Leak
ar: الإبلاغ عن تسرب الذاكرة
zh_hant: 內存洩漏上報

# MeSwitchSkin
source: Change Skin
ar: تغيير الواجهة
zh_hant: 更換主題

# MeSwitchLaunguage
source: Change Launguage
ar: تغيير اللغة
zh_hant: 切換語言

# GroupRequestJoinGroupFormat
source: %@ requests to join group chat.
ar: %@ يطلب الانضمام إلى محادثة المجموعة.
zh_hant: %@ 申請加入群聊

# GroupJoin
source: Add Group
ar: إضافة مجموعة
zh_hant: 添加群組

# FriendRequestFormat
source: I'm %@
ar: أنا %@
zh_hant: 我是%@

# FriendRequestFillInfo
source: Add Friend
ar: إضافة صديق
zh_hant: 添加好友

# FriendOneWay
source: One-way Friend
ar: صديق في اتجاه واحد
zh_hant: 單向好友

# FriendAddResultSuccessWait
source: Sent successfully. Wait for approval.
ar: تم الإرسال بنجاح. انتظر الموافقة.
zh_hant: 發送成功,等待審核同意

# FriendAddResultForbid
source: The other user disabled friend request.
ar: المستخدم الآخر قام بتعطيل طلب الصداقة.
zh_hant: 對方禁止添加

# FriendAddResultSuccess
source: Added to friend list
ar: تمت إضافته إلى قائمة الأصدقاء
zh_hant: 已添加到好友列表

# FriendAddResultExists
source: You're already friends.
ar: أنتما بالفعل أصدقاء.
zh_hant: 對方已是您的好友

# FriendAddVerificationMessage
source: Verification Message
ar: رسالة التحقق
zh_hant: 驗證消息

# FriendAddTitle
source: Add Friend
ar: إضافة صديق
zh_hant: 加好友

# SearchGroupPlaceholder
source: User ID
ar: معرف المستخدم
zh_hant: 用戶ID

# GroupMember
source: Group Members
ar: أعضاء المجموعة
zh_hant: 群成員

# GroupAddFirend
source: Add Contact
ar: إضافة جهة اتصال
zh_hant: 添加聯繫人

# GroupDeleteFriend
source: Delete Contact
ar: حذف جهة اتصال
zh_hant: 刪除聯繫人

# ErrrorTipsCreate
source: Creation failed
ar: فشل الإنشاء
zh_hant: 創建失敗

# ErrorTipsDestory
source: Termination failed
ar: فشل الإنهاء
zh_hant: 銷毀失敗

# ErrirTipsHeart
source: Heartbeat failed
ar: فشل نبض القلب
zh_hant: 心跳失敗

# ErrorTipsParamtersValid
source: Parameter conversion failed
ar: فشل تحويل المعلمات
zh_hant: 參數失敗

# ErrorTipsServerRequest
source: Service request failed
ar: فشل طلب الخدمة
zh_hant: 服務請求失敗

# ErrorTipsOpFailed
source: Operation failed. Check network.
ar: فشل العملية. تحقق من الشبكة.
zh_hant: 操作失敗，請檢查網絡

# ErrorTipsInvalidUser
source: Invalid username format
ar: تنسيق اسم المستخدم غير صالح
zh_hant: 用戶名格式錯誤

# ErrorTIpsInvalidUserPwd
source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صالحة
zh_hant: 用戶名或密碼不合法

# ErrorTipsUsernameExists
source: Username already exists.
ar: اسم المستخدم موجود بالفعل.
zh_hant: 用戶名已存在

# ErrorTipsServer
source: Server error
ar: خطأ في الخادم
zh_hant: 服務器錯誤

# ErrorTipsUsernameNull
source: User does not exist.
ar: المستخدم غير موجود.
zh_hant: 用戶不存在

# ErrorTipsPwdError
source: Incorrect password
ar: كلمة المرور غير صحيحة
zh_hant: 密碼錯誤

# TipsCheckCodeHasSent
source: Verification code sent
ar: تم إرسال رمز التحقق
zh_hant: 驗證碼已發出

# TipsGetCheckcode
source: Send Code
ar: إرسال الرمز
zh_hant: 獲取驗證碼

# TipsCheckCodeFailedFormat
source: Failed to get verification code. ErrorCode: %d. ErrorMsg: %@
ar: فشل الحصول على رمز التحقق. رمز الخطأ: %d. رسالة الخطأ: %@
zh_hant: 獲取驗證碼失敗。錯誤碼：%d。錯誤信息：%@

# TipsPhoneCodeNotNull
source: Mobile number and verification code are required.
ar: الرقم الهاتفي ورمز التحقق مطلوبان.
zh_hant: 手機號和驗證碼不能為空

# TipsPhoneNotMatch
source: This mobile number is not the one that receives the verification code. Please confirm.
ar: هذا الرقم الهاتفي ليس الرقم الذي يتلقى رمز التحقق. يرجى التأكد.
zh_hant: 當前手機號與獲取驗證碼手機號不一致，請確認

# TipsLoginErrorWithUserIdfailed
source: Login failed. Failed to get userId or userSig.
ar: فشل تسجيل الدخول. فشل الحصول على معرف المستخدم أو userSig.
zh_hant: 登錄失敗，userId or userSig 獲取失敗

# TipsLoginErrorFormat
source: Login failed. ErrorCode: %d. ErrorMsg: %@
ar: فشل تسجيل الدخول. رمز الخطأ: %d. رسالة الخطأ: %@
zh_hant: 登錄失敗。錯誤碼：%d。錯誤信息：%@

# TipsLoginWithAccountPassword
source: Log in via password
ar: تسجيل الدخول عبر كلمة المرور
zh_hant: 帳號密碼登錄

# TipsLoginWithAccountDirectly
source: Log in without password
ar: تسجيل الدخول بدون كلمة مرور
zh_hant: 帳號直接登錄

# TipsOldVersionRegisterAccount
source: Users who use older versions and have a registered account can log in by directly entering the account name and password.
ar: يمكن للمستخدمين الذين يستخدمون الإصدارات الأقدم ولديهم حساب مسجل تسجيل الدخول عن طريق إدخال اسم الحساب وكلمة المرور مباشرة.
zh_hant: 老版本用戶如果註冊了帳號密碼，可以直接輸入帳號密碼登錄

# exclued_from_unread_count
source: IgnoreReadCountMsg
ar: تجاهل عدد الرسائل غير المقروءة
zh_hant: 不計入未讀數消息

# TipsPhoneNotNull
source: Mobile number is required.
ar: رقم الهاتف المحمول مطلوب.
zh_hant: 手機號不能為空

# GetSmsErrorFormat
source: Failed to get verifcation code！(%@)
ar: فشل الحصول على رمز التحقق! (%@)
zh_hant: 獲取驗證碼錯誤，請刷新重試！(%@)

# MarkAllMessageAsReadSucc
source: Success to mark all as read
ar: تم الإشارة إلى جميع الرسائل كمقروءة بنجاح
zh_hant: 清空未讀成功

# MarkAllMessageAsReadErrFormat
source: Error, %d, %@
ar: خطأ، %d، %@
zh_hant: 清空未讀失敗, %d, %@

source: Choose Nation or Region
ar: اختر الدولة أو المنطقة
zh_hant: 選擇國家或地區

# ChangeStyle
source: Style
ar: النمط
zh_hant: 切換風格

# ChangeSkin
source: Theme
ar: السمة
zh_hant: 切換皮膚

# ChangeLanguage
source: Language
ar: اللغة
zh_hant: 切換語言

# SimpleChinese
source: Chinese,Simplified
ar: الصينية المبسطة
zh_hant: 簡體中文

source: English
ar: الإنجليزية
zh_hant: 英語(English)

# CurrentLanguage
source: English
ar: الإنجليزية
zh_hant: 簡體中文

source: Classic
ar: الكلاسيكية
zh_hant: 經典版

source: Minimalist
ar: الحد الأدنى
zh_hant: 簡約版

# ThemeNameSerious
source: Solemn
ar: جدي
zh_hant: 深沉

# ThemeNameLight
source: Light
ar: فاتح
zh_hant: 輕量

# ThemeNameLivey
source: Lively
ar: حيوي
zh_hant: 活潑

# ThemeNameDark
source: Dark
ar: داكن
zh_hant: 深色

# ThemeNameSystem
source: System
ar: النظام
zh_hant: 跟隨系統

# TUIKitAboutUsSDKVersion
source: SDK Version
ar: إصدار SDK
zh_hant: SDK版本

# TUIKitAboutUsPrivacyRegulations
source: Privacy Policy
ar: سياسة الخصوصية
zh_hant: 隱私條例

# TUIKitAboutUsUserAgreement
source: User Agreement
ar: اتفاقية المستخدم
zh_hant: 用戶協議

# TUIKitAboutUsDisclaimer
source: Disclaimer
ar: إخلاء المسؤولية
zh_hant: 免責聲明

# TUIKitAboutUsPersonalInformationCollectionList
source: Personal Information Collected
ar: المعلومات الشخصية المجمعة
zh_hant: 個人信息收集清單

# TUIKitAboutUs3PartySharingList
source: Information Shared with Third Parties
ar: المعلومات المشتركة مع الأطراف الثالثة
zh_hant: 第三方信息共享清單

# TUIKitAboutUsCloseAccount
source: Cancel Account
ar: إلغاء الحساب
zh_hant: 註銷賬戶

# TUIKitAboutUsContactUs
source: Contact Us
ar: اتصل بنا
zh_hant: 聯繫我們

# TUIKitAboutUsDisclaimerText
source: Tencent Cloud Instant Messaging APP ("this product") is a test product provided by Tencent Cloud, and Tencent Cloud enjoys the copyright and ownership of this product. This product is only used for functional experience and must not be used for any commercial purposes. In order to comply with the regulatory requirements of relevant departments, any pornography, abusive, violent, and politically related content is strictly prohibited during use.
ar: تطبيق Tencent Cloud Instant Messaging هو منتج اختباري يتم توفيره من قبل Tencent Cloud، وتتمتع Tencent Cloud بحقوق النشر والملكية لهذا المنتج. يتم استخدام هذا المنتج فقط لتجربة الوظائف ولا يجوز استخدامه لأي أغراض تجارية. من أجل الامتثال لمتطلبات التنظيم الخاصة بالإدارات ذات الصلة، يتم منع بشدة أي محتوى إباحي أو مسيء أو عنيف أو ذي صلة سياسيًا أثناء الاستخدام.
zh_hant: 騰訊雲IM APP（“本產品”）是由騰訊雲提供的一款測試產品，騰訊雲享有本產品的著作權和所有權。本產品僅用于功能體驗，不得用于任何商業用途。為配合相關部門監管要求，嚴禁在使用中有任何色情、辱罵、暴恐、涉政等違法內容傳播。

# TUIKitAboutUsCloseAccountDescribe
source: After canceling this account, you will be unable to use it, and related data will be permanently deleted. Current account:%@
ar: بعد إلغاء هذا الحساب، لن تتمكن من استخدامه، وسيتم حذف البيانات ذات الصلة بشكل دائم. الحساب الحالي: %@
zh_hant: 註銷後，您將無法使用當前帳號，相關數據也將刪除無法找回。當前帳號ID:%@

# TUIKitAboutUsCloseAccountAlterMsg
source: Are you sure you want to cancel this account?
ar: هل أنت متأكد أنك تريد إلغاء هذا الحساب؟
zh_hant: 確認註銷帳號嗎?

# TUIKitAboutUsCloseAccountAlterAction1
source: Confirm
ar: تأكيد
zh_hant: 註銷

# TUIKitAboutUsCloseAccountError1
source: Cancellation failed. No token or mobile number associated with the current account is detected. Please log in with your mobile number.
ar: فشل إلغاء الحساب. لم يتم اكتشاف رمز أو رقم هاتف محمول مرتبط بالحساب الحالي. يرجى تسجيل الدخول باستخدام رقم هاتفك.
zh_hant: 註銷失敗,當前帳號未查到token或手機號，請使用手機號登錄

# TUIKitAboutUsCloseAccountSuccessful
source: Account cancelled successfully
ar: تم إلغاء الحساب بنجاح
zh_hant: 註銷成功

# TUIKitAboutUsCloseAccountFailed
source: Account cancelled failed
ar: فشل إلغاء الحساب
zh_hant: 註銷失敗

# TUIPrivateProtocolAlertMsg
source: Welcome to Tencent Cloud Instant Messaging. To protect your personal information, we have updated the "Privacy Policy", involving improving the specific contents and purposes of collecting user information, and adding third-party SDKs. Please carefully read the "User Agreement","Summary of Privacy Policy","Privacy Policy","Personal Information Collected" and "Information Shared with Third Parties", and tap Agree and Continue to use our products and services if you agree to them.
ar: مرحبًا بك في تطبيق تينسنت للتواصل الفوري Chat، ولحماية سلامة معلوماتك الشخصية، قمنا بتحديث "سياسة الخصوصية"، وذلك لتحسين محتوى جمع المعلومات الخاصة بالمستخدمين وأغراضها، وزيادة استخدام SDK الخاص بالأطراف الثالثة وغيرها من المحتويات. يرجى النقر على "اتفاقية المستخدم" و"ملخص سياسة الخصوصية" و"سياسة الخصوصية" و"قائمة جمع المعلومات الشخصية" و"قائمة مشاركة المعلومات مع الأطراف الثالثة" وقراءتها بعناية. إذا كنت توافق على هذه المحتويات، فيرجى النقر على "موافق ومتابعة" لبدء استخدام منتجاتنا وخدماتنا!
zh_hant: 歡迎使用騰訊雲即時通信 IM，為保護您的個人信息安全，我們更新了《隱私政策》，主要完善了收集用戶信息的具体內容和目的、增加了第三方SDK使用等方面的內容。 請您點擊 《用戶協議》、《隱私政策摘要》、《隱私政策》、《個人信息收集清單》和《第三方信息共享清單》並仔細閱讀，如您同意以上內容，請點擊“同意並繼續”，開始使用我們的產品與服務！

# TUIPrivateProtocolHighlight1
source: "User Agreement"
ar: "اتفاقية المستخدم"
zh_hant: 《用戶協議》

# TUIPrivateProtocolHighlight2
source: "Privacy Policy"
ar: "سياسة الخصوصية"
zh_hant: 《隱私政策》

# TUIPrivateProtocolHighlight3
source: "Personal Information Collected"
ar: "قائمة جمع المعلومات الشخصية"
zh_hant: 《個人信息收集清單》

# TUIPrivateProtocolHighlight4
source: "Information Shared with Third Parties"
ar: "قائمة مشاركة المعلومات مع الأطراف الثالثة"
zh_hant: 《第三方信息共享清單》

# TUIPrivateProtocolHighlight5
source: "Summary of Privacy Policy"
ar: "ملخص سياسة الخصوصية"
zh_hant: 《隱私政策摘要》

# TUIPrivateProtocolAlertActionAgree
source: Agree and Continue
ar: موافق ومتابعة
zh_hant: 同意並繼續

# TUIPrivateProtocolAlertActionDisagree
source: Disagree and Exit
ar: غير موافق والخروج
zh_hant: 不同意並退出

# TipsSystemVerifyError
source: Failed to verify user actions or parameter
ar: فشل التحقق من إجراءات المستخدم أو المعلمة
zh_hant: 驗證用戶操作或參數錯誤

# TipsSystemError
source: System unknown error occurred
ar: حدث خطأ غير معروف في النظام
zh_hant: 後端未知的系統錯誤

# TipsServiceUnavailable
source: Service is unavailable
ar: الخدمة غير متاحة
zh_hant: 後端依賴的服務不可用

# TipsServiceResponseInvalid
source: Response is invalid
ar: الاستجابة غير صالحة
zh_hant: 後端服務返回的結果不符合規範

# TipsServiceSmsFailed
source: Failed to send SMS message
ar: فشل في إرسال رسالة SMS
zh_hant: SMS發送短信服務失敗

# TipsServiceDBFailed
source: Service DB error occurred
ar: حدث خطأ في قاعدة بيانات الخدمة
zh_hant: 後端服務DB錯誤，SQL語句執行失敗

# TipsServiceUnknownError
source: Service unknown error occurred
ar: حدث خطأ غير معروف في الخدمة
zh_hant: 服務未知錯誤

# TipsUserCodeInvalid
source: SMS verification code is invalid
ar: رمز التحقق من رسالة SMS غير صالح
zh_hant: 用戶登錄失敗，錯誤的驗證碼

# TipsUserCodeExpired
source: SMS verification code is expired
ar: انتهت صلاحية رمز التحقق من رسالة SMS
zh_hant: 用戶登錄失敗，驗證碼已過期

# TipsUserCodeConsumed
source: The verification code has already been used
ar: تم استخدام رمز التحقق بالفعل
zh_hant: 驗證碼已經使用過了，請重新獲取

# TipsUserTokenExpired
source: User token is expired, please login again
ar: انتهت صلاحية رمز المستخدم، يرجى تسجيل الدخول مرة أخرى
zh_hant: 用戶Token已經過期，請重新登錄

# TipsUserTokenInvalid
source: User token is invalid, please login again
ar: رمز المستخدم غير صالح، يرجى تسجيل الدخول مرة أخرى
zh_hant: 用戶Token不正確，請重新登錄

# TipsUseInfoEmpty
source: User's info is empty
ar: معلومات المستخدم فارغة
zh_hant: 用戶的信息為空

# TipsUserNotExists
source: User does not exist
ar: المستخدم غير موجود
zh_hant: 用戶不存在

# TipsUserEmailInvalid
source: User's email is invalid
ar: البريد الإلكتروني للمستخدم غير صالح
zh_hant: 給用戶發送郵件時參數錯誤

# TipsUserQueryParams
source: Query parameter is error
ar: معلمة الاستعلام غير صحيحة
zh_hant: 用戶查詢時參數錯誤

# TipsUserQueryLimit
source: Too much query data, flow restriction is triggered
ar: الكثير من بيانات الاستعلام، تم تفعيل قيود التدفق
zh_hant: 用戶查詢數據過多，觸發限流

# TipsUserOAuthParams
source: User OAuth parameter is error
ar: معلمة مصادقة المستخدم غير صحيحة
zh_hant: 用戶OAuth參數異常

# TUIThemeNameSystemFollowTitle
source: Automatic
ar: تلقائي
zh_hant: 跟隨系統自動切換

# TUIThemeNameSystemFollowSubTitle
source: After this function is enabled, only the default skin (light/dark) will be displayed. Other skin styles cannot be switched
ar: بعد تمكين هذه الوظيفة، سيتم عرض السمة الافتراضية فقط (فاتحة/داكنة). لا يمكن تبديل أنماط السمات الأخرى
zh_hant: 開啟後僅展示默認皮膚 (輕快/深色)，不可切換其他皮膚樣式

# UpgradeNow
source: Upgrade
ar: الترقية الآن
zh_hant: 立即升級

source: Online status
ar: حالة الاتصال عبر الإنترنت
zh_hant: 在線狀態

source: Chat
ar: الدردشة
zh_hant: 聊天

# TabBarItemMessageText_mini
source: Chats
ar: المحادثات
zh_hant: 聊天

# TabBarItemContactText_mini
source: Contact
ar: جهات الاتصال
zh_hant: 聯繫人

# TabBarItemSettingText_mini
source: Settings
ar: الإعدادات
zh_hant: 設置

# TabBarItemCallsRecordText_mini
source: Calls
ar: المكالمات
zh_hant: 通話記錄

# TUIStartPageTitle
source: Tencent Cloud Chat
zh_hant: 騰訊雲即時通信 IM
